tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql", restart_service: true
# Fast, highly customisable system info script
brew "neofetch"
# General-purpose scripting language
brew "php", restart_service: true
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# mobile-shell - Remote terminal application
brew "mosh"

# UI Apps
cask "dozer"
cask "rectangle"
cask "google-chrome"
cask "notion"
cask "tableplus"
cask "iterm2"
cask "postman"
cask "docker"
cask "sketch"

# Appstore Apps
mas "Enpass", id: 732710998
mas "Telegram", id: 747648890
